B-Bautista-Chua-Fausto-Villarico/Mock_Elections_10.5/app/controllers/candidates_controller.rb

  def create
    @candidate = Candidate.new(candidate_params)

    if @candidate.save
---
INSERT INTO "candidates" ("first_name", "last_name", "slogan", "position_id", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @candidate = Candidate.find(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 1]]