B-Bautista-Chua-Fausto-Villarico/Mock_Elections_10.5/app/controllers/pages_controller.rb

  def index
    @positions = Position.all
---
SELECT "positions".* FROM "positions"