B-Bautista-Chua-Fausto-Villarico/Mock_Elections_10.5/app/controllers/positions_controller.rb

  def index
    @positions = Position.all
---
SELECT "positions".* FROM "positions"

  def show
    @position = Position.find(params[:id])

    ###########################################################################
    #Checks is current user has voted for one in the ENTIRE candidate list
    if user_signed_in?
     votecounter = 0
     current_user.votes.each do |v|
        @position.candidates.each do |candidate|
         candidate.votes.each do |v2|
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ?  [["user_id", 2]]
SELECT "candidates".* FROM "candidates" WHERE "candidates"."position_id" = ?  [["position_id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."candidate_id" = ?  [["candidate_id", 1]]