B-Bautista-Chua-Fausto-Villarico/Mock_Elections_10.5/app/controllers/votes_controller.rb

  def new

    @vote = Vote.new
    @candidate = Candidate.find(params[:candidate_id])
    #This verifies if the user has voted for a single candidate
      if Vote.exists?(candidate_id: @candidate.id, user_id: current_user.id)
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 7]]
SELECT  1 AS one FROM "votes" WHERE "votes"."candidate_id" = ? AND "votes"."user_id" = ? LIMIT 1  [["candidate_id", 7], ["user_id", 8]]

  def create

    @vote = Vote.new(vote_params)
    @candidate = Candidate.find(params[:candidate_id])
    @vote.candidate = @candidate
    @vote.user = current_user

    if @vote.save
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "votes" ("comments", "candidate_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comments", "cool siya eh"], ["candidate_id", 7], ["user_id", 8], ["created_at", "2015-09-06 04:52:13.021228"], ["updated_at", "2015-09-06 04:52:13.021228"]]