B-Bautista-Chua-Fausto-Villarico/Mock_Elections_10.5/app/views/pages/index.html.erb

SELECT "candidates".* FROM "candidates" WHERE "candidates"."position_id" = ?  [["position_id", 1]]
---

           <% position.candidates.each do |c| %>