B-Bautista-Chua-Fausto-Villarico/Mock_Elections_10.5/app/views/positions/index.html.erb

                  <!--CARD-->
                    <% position.candidates.each do |c| %>
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."position_id" = ?  [["position_id", 1]]