B-Bautista-Chua-Fausto-Villarico/Mock_Elections_10.5/app/views/positions/show.html.erb

SELECT "candidates".* FROM "candidates" WHERE "candidates"."position_id" = ?  [["position_id", 1]]
---

      <%@position.candidates.each do |candidate| %>

SELECT "votes".* FROM "votes" WHERE "votes"."candidate_id" = ?  [["candidate_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."candidate_id" = ?  [["candidate_id", 1]]
---
          <td> <%= candidate.slogan %> </td>
          <td> <%= candidate.votes.count %> </td>