B-Bautista-Chua-Fausto-Villarico/Mock_Elections_10.5/app/views/users/show.html.erb

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ?  [["user_id", 2]]
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 7]]
---
        </tr>
        <% @user.votes.each do |vote| %>
        <tr>
          <td><%= vote.candidate.first_name %></td>